tutorials/incompressible/simpleWindFoam/turbineSiting/0/include/sideAndTopPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

top
{
    type slip;
}

sides
{
    type slip;
}

// ************************************************************************* //
